[
  {
    "id": "mu-sigma-intern",
    "title": "Data Scientist Intern",
    "company": "Mu Sigma Inc.",
    "location": "Austin, Texas, United States",
    "timeframe": "Jul 2025 – Present",
    "status": "current",
    "logo": "/musigmalogo.jpeg",
    "type": "internship",
    "stack": ["Python", "SQL", "pandas", "Airflow", "Playwright", "UI Automation"],
    "shortDescription": "Analyzing erratic-order patterns and building data pipelines for CPG clients using hypothesis-driven approaches.",
    "quickRead": [
      "Analyzed erratic-order patterns for CPG client using hypothesis-driven approach",
      "Built data pipelines in Python (pandas) and SQL to quantify OTIF and stockout drivers",
      "Designed configurable UI-automation-based ingestion pipeline with Airflow and Playwright"
    ],
    "fullStory": {
      "problem": "CPG clients needed to understand and improve erratic-order patterns, requiring analysis of OTIF (On Time In Full) metrics, review time for flagged orders, order variability, and stockout risk.",
      "actions": [
        "Analyzed erratic-order patterns for CPG client using hypothesis-driven approach, performed as-is / to-be / gap analysis and defined KPIs (OTIF, review time for flagged orders, order variability, stockout risk)",
        "Built data pipelines and analyses in Python (pandas) and SQL to quantify drivers of OTIF and stockouts, produced KPI views and concise summaries for business stakeholders",
        "Designed a configurable, UI-automation-based ingestion pipeline orchestrated with Airflow and Playwright for web today, architected to extend to SAP GUI and desktop applications, with robust logging, retries, and idempotency"
      ],
      "impact": [
        "Established comprehensive KPI framework for order pattern analysis",
        "Created data-driven insights for business stakeholders on OTIF and stockout drivers",
        "Built scalable ingestion pipeline architecture for future SAP GUI and desktop application integration"
      ],
      "learnings": "Gained experience in hypothesis-driven data analysis, learned to build robust data pipelines with UI automation, and developed skills in creating business-ready KPI views and stakeholder communication."
    }
  },
  {
    "id": "augle-ai-2024",
    "title": "Software Engineer Intern",
    "company": "Augle AI",
    "location": "Remote",
    "timeframe": "Jun 2024 – Aug 2024",
    "logo": "/augle_ai_logo.jpeg",
    "type": "internship",
    "stack": ["Python", "Scrapy", "Selenium", "MongoDB", "Web Scraping"],
    "shortDescription": "Engineered scalable web scraping pipelines and MongoDB storage solutions for industrial product data extraction.",
    "quickRead": [
      "Engineered scalable web scraping pipeline extracting 1,000+ product details from industrial websites",
      "Designed MongoDB-based storage solution for structured product data integration with AI chatbot systems",
      "Optimized scraping performance with dynamic spider settings and smart request delays"
    ],
    "fullStory": {
      "problem": "The company needed to efficiently extract product details and technical specifications from industrial websites to feed downstream AI chatbot systems with accurate, structured data.",
      "actions": [
        "Engineered a scalable web scraping pipeline using Python, Scrapy, and Selenium to extract over 1,000 product details and technical specs from two industrial websites",
        "Designed a MongoDB-based storage solution for structured product data, enabling smooth integration with downstream AI chatbot systems",
        "Optimized scraping performance with dynamic spider settings like auto-throttling and smart request delays to handle deeply nested site categories with accuracy and speed"
      ],
      "impact": [
        "Boosted data retrieval efficiency by 40% through optimized scraping pipeline",
        "Successfully extracted comprehensive product data from complex industrial websites",
        "Established scalable data storage architecture for AI system integration"
      ],
      "learnings": "Gained expertise in web scraping technologies, learned to design scalable data pipelines, and developed skills in optimizing performance for complex website structures."
    }
  },
  {
    "id": "augle-ai-2023",
    "title": "Software Engineer Intern",
    "company": "Augle AI",
    "location": "Remote",
    "timeframe": "May 2023 – Aug 2023",
    "logo": "/augle_ai_logo.jpeg",
    "type": "internship",
    "stack": ["Python", "Flask", "OpenCV", "SMTP", "RTCP", "MongoDB", "PyTorch"],
    "shortDescription": "Developed comprehensive inspection and output system for data processing and real-time insights generation.",
    "quickRead": [
      "Implemented inspector modules for image, video, and point cloud data using Python and related libraries",
      "Developed output modules for email notifications and RTCP integration with external APIs",
      "Collaborated with development team to ensure seamless module integration and system reliability"
    ],
    "fullStory": {
      "problem": "Augle AI needed a comprehensive inspection and output system to enhance data processing capabilities and generate actionable insights for users through intelligent analysis of various data types.",
      "actions": [
        "Implemented inspector modules for image, video, and point cloud data using Python and related libraries",
        "Developed output modules for email notifications and real-time control protocol (RTCP) integration, incorporating external APIs and libraries",
        "Collaborated with a development team of three to ensure seamless module integration",
        "Conducted debugging, code optimization, and rigorous testing for system reliability"
      ],
      "impact": [
        "Successfully deployed inspector modules to analyze and process various data types",
        "Integrated email functionality for notifications and reporting",
        "Developed an RTCP module for real-time video streaming",
        "The FullApp system made work for users 30% more efficient through intelligent insights and actionable outputs"
      ],
      "learnings": "Gained experience in computer vision technologies, learned to integrate multiple data processing modules, and developed skills in real-time communication protocols and system optimization."
    }
  },
  {
    "id": "psu-math-grader",
    "title": "Mathematics Grader",
    "company": "Penn State University",
    "location": "University Park, PA",
    "timeframe": "2024",
    "logo": "/pennstatelogo.jpeg",
    "type": "academic",
    "stack": ["Mathematical Analysis", "Communication", "Time Management"],
    "shortDescription": "Graded assignments and provided feedback for undergraduate mathematics courses.",
    "quickRead": [
      "Graded 200+ assignments weekly with detailed feedback",
      "Maintained 98% accuracy in grading consistency reviews",
      "Helped students improve problem-solving through targeted feedback"
    ],
    "fullStory": {
      "problem": "The mathematics department needed reliable graders who could provide consistent, helpful feedback to help students improve their problem-solving skills and understanding of complex concepts.",
      "actions": [
        "Graded over 200 assignments weekly for calculus and linear algebra courses, ensuring consistent application of rubrics",
        "Provided detailed written feedback highlighting common mistakes and suggesting improvement strategies",
        "Collaborated with professors to align grading standards and identify students needing additional support",
        "Developed efficient grading workflows to meet tight deadlines while maintaining quality"
      ],
      "impact": [
        "Maintained 98% accuracy rate in grading consistency reviews",
        "Helped improve student performance through targeted feedback",
        "Reduced professor grading workload by 60 hours per semester",
        "Identified and reported common conceptual gaps to improve course instruction"
      ],
      "learnings": "Developed strong attention to detail, improved communication skills for providing constructive feedback, and learned to manage time effectively under consistent deadlines."
    }
  },
  {
    "id": "psu-learning-assistant",
    "title": "Learning Assistant",
    "company": "Penn State University",
    "location": "University Park, PA",
    "timeframe": "Aug 2023 – Dec 2023",
    "logo": "/pennstatelogo.jpeg",
    "type": "academic",
    "stack": ["Teaching", "Communication", "Calculus", "Problem-Solving"],
    "shortDescription": "Supported MATH 141 - Calculus 2 students through weekly sessions and individual problem-solving assistance.",
    "quickRead": [
      "Hosted weekly LA sessions twice a week for MATH 141 - Calculus 2",
      "Addressed individual student problems to enhance problem-solving skills",
      "Facilitated interactive worksheet sessions with professor once a week"
    ],
    "fullStory": {
      "problem": "Students in MATH 141 - Calculus 2 needed additional support beyond regular lectures to reinforce core concepts, troubleshoot challenges, and develop deeper understanding of calculus principles.",
      "actions": [
        "Hosted weekly LA sessions twice a week to reinforce core concepts, troubleshoot challenges, and provide real-world applications of calculus principles",
        "Addressed individual student problems to enhance their problem-solving skills and promote a deeper understanding of course materials",
        "Facilitated interactive worksheet sessions with the professor once a week to reinforce key concepts, enhance problem-solving skills, and foster a dynamic and participatory learning environment"
      ],
      "impact": [
        "Provided consistent weekly support for Calculus 2 students throughout the semester",
        "Enhanced student problem-solving abilities through targeted individual assistance",
        "Created an interactive learning environment that complemented classroom instruction"
      ],
      "learnings": "Developed exceptional communication and interpersonal skills, learned to break down complex mathematical concepts into digestible components, and gained experience in adapting to various learning styles while collaborating effectively with educators."
    }
  }
]